InformationRegisters/ДатыЗапретаИзменения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаИзменения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеДатыЗапрета</Name>
					<Comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыНазначенияДатЗапрета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПланированиеАвансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПланированиеАвансов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисленияБазыРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаБазыРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ФормаПодбораДолговПоЛицевымСчетам/Ext/Form/Module.bsl
// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Параметры.Дата;
	Организация = Параметры.Организация;
	ЛицевойСчет = Параметры.ЛицевойСчет;
	ВалютаДенежныхСредств = Параметры.ВалютаДенежныхСредств;
	Ссылка = Параметры.Ссылка;
	СуммаДокумента = Параметры.СуммаДокумента;
	ДатаАванса = Параметры.Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Раздел = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.Здания)
	|	И ДатыЗапретаИзменения.Объект = &Здание";
	
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		Период = Выборка.ДатаЗапрета;
	КонецЕсли;
	
	АдресРасшифровкаПлатежаВХранилище = Параметры.АдресРасшифровкаПлатежаВХранилище;
	ОтобранныеДолги.Загрузить(ПолучитьИзВременногоХранилища(АдресРасшифровкаПлатежаВХранилище));
	
	// Удаление строк с незаполненной суммой.
	МассивСтрокДляУдаления = Новый Массив;
	Для каждого ТекСтрока Из ОтобранныеДолги Цикл
		Если ТекСтрока.Сумма = 0 Тогда
			МассивСтрокДляУдаления.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекЭлемент Из МассивСтрокДляУдаления Цикл
		ОтобранныеДолги.Удалить(ТекЭлемент);
	КонецЦикла;
	
	ЗаполнитьДолги();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РассчитатьСуммаИтог();
	
КонецПроцедуры // ПриОткрытии()

// Процедура рассчитывает итоговую сумму.
//
&НаКлиенте
Процедура РассчитатьСуммаИтог()
	
	СуммаИтог = 0;
	
	Для каждого ТекСтрока Из ОтобранныеДолги Цикл
		СуммаИтог = СуммаИтог + ТекСтрока.Сумма;
	КонецЦикла;
	
КонецПроцедуры // РассчитатьСуммаИтог()

// Процедура помещает результаты подбора в хранилище.
//
&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТаблицаОтобранныеДолги = ОтобранныеДолги.Выгрузить();
	ПоместитьВоВременноеХранилище(ТаблицаОтобранныеДолги, АдресРасшифровкаПлатежаВХранилище);
	
КонецПроцедуры // ЗаписатьПодборВХранилище()

// Процедура помещает результаты выбора в подбор.
//
&НаКлиенте
Процедура СписокДолговВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Сумма = ТекущаяСтрока.Сумма;
	Если ЗапрашиватьСумму Тогда
		Если НЕ ВвестиЧисло(Сумма, НСтр("ru='Введите сумму';uk='Уведіть суму'"), , ) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СуммаДокумента <> 0 Тогда
		СуммаОсталосьЗаполнить = СуммаДокумента - ОтобранныеДолги.Итог("Сумма");
		
		Если СуммаОсталосьЗаполнить <= 0 тогда
			Возврат;
		КонецЕсли;
		
		Если Сумма > СуммаОсталосьЗаполнить тогда
			Сумма = СуммаОсталосьЗаполнить;
		КонецЕсли;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = Сумма;
	
	СтруктураПоиска = Новый Структура("Услуга, МесяцНачисления", ТекущаяСтрока.Услуга, ТекущаяСтрока.МесяцНачисления);
	Строки = ОтобранныеДолги.НайтиСтроки(СтруктураПоиска);
	
	Если Строки.Количество() > 0 Тогда
		НоваяСтрока = Строки[0];
		НоваяСтрока.Сумма = НоваяСтрока.Сумма + Сумма;
	Иначе
		НоваяСтрока = ОтобранныеДолги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЕсли;
	
	Элементы.ОтобранныеДолги.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	РассчитатьСуммаИтог();
	ЗаполнитьДолги();
	
КонецПроцедуры // СписокДолговВыборЗначения()

// Процедура - обработчик нажатия кнопки ОК.
//
&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьПодборВХранилище();
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры // ОК()

// Процедура - обработчик нажатия кнопки Обновить.
//
&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьДолги();
	
КонецПроцедуры // Обновить()

// Процедура - обработчик нажатия кнопки ЗапрашиватьСумму.
//
&НаКлиенте
Процедура ЗапрашиватьСумму(Команда)
	
	ЗапрашиватьСумму = НЕ ЗапрашиватьСумму;
	Элементы.ЗапрашиватьСумму.Пометка = ЗапрашиватьСумму;
	
КонецПроцедуры // ЗапрашиватьСумму()

// Процедура - обработчик события ПриИзменении списка ОтобранныеДолги.
//
&НаКлиенте
Процедура ОтобранныеДолгиПриИзменении(Элемент)
	
	РассчитатьСуммаИтог();
	ЗаполнитьДолги();
	
КонецПроцедуры // ОтобранныеДолгиПриИзменении()

// Процедура - обработчик события ПриНачалеРедактирования списка ОтобранныеДолги.
//
&НаКлиенте
Процедура ОтобранныеДолгиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		РассчитатьСуммаИтог();
		ЗаполнитьДолги();
	КонецЕсли;
	
КонецПроцедуры // ОтобранныеАвансыПриНачалеРедактирования()

// Процедура заполняет расшифровку платежа.
//
&НаСервере
Процедура ЗаполнитьРасшифровкуПлатежа()
	
	// Заполнение расшифровки расчетов по умолчанию.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Сумма,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	|		РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|		ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстатки.Организация КАК Организация,
	|		ЛОЖЬ КАК ПризнакАванса
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления < &Период
	|					И МесяцНачисления > &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетам.Услуга,
	|		РасчетыПоЛицевымСчетам.МесяцНачисления,
	|		РасчетыПоЛицевымСчетам.Сумма,
	|		РасчетыПоЛицевымСчетам.Организация,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	|	ГДЕ
	|		РасчетыПоЛицевымСчетам.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления < &Период
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления > &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления = &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстаткиАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамАвансы.Сумма,
	|		РасчетыПоЛицевымСчетамАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетамАвансы
	|	ГДЕ
	|		РасчетыПоЛицевымСчетамАвансы.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетамАвансы.МесяцНачисления = &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга,
	|		&ПустаяДата,
	|		ПланированиеАвансовЛицевыеСчета.СуммаНачислено,
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	|	ГДЕ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация = &Организация
	|		И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата >= &ДатаНач
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата <= &ДатаКон
	|		И НЕ ПланированиеАвансовЛицевыеСчета.Ссылка.ПометкаУдаления) КАК РасчетыПоЛицевымСчетамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ВидУслуги.ПолеСортировки,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаАванса));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДатаАванса));
	
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	
	ОтобранныеДолги.Очистить();
	
	СуммаОсталосьРаспределить = СуммаДокумента;
	
	Пока СуммаОсталосьРаспределить > 0 Цикл
		
		НоваяСтрока = ОтобранныеДолги.Добавить();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатаЗапроса);
			
			Если ВыборкаРезультатаЗапроса.Сумма <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				НоваяСтрока.Сумма = ВыборкаРезультатаЗапроса.Сумма;
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - ВыборкаРезультатаЗапроса.Сумма;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				НоваяСтрока.Сумма =	СуммаОсталосьРаспределить;
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Сумма = СуммаОсталосьРаспределить;
			НоваяСтрока.ПризнакАванса = Истина;
			СуммаОсталосьРаспределить = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРасшифровкуПлатежа()

// Процедура - обработчик нажатия кнопки ЗаполнитьАвтоматически.
//
&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	
	ЗаполнитьРасшифровкуПлатежа();
	РассчитатьСуммаИтог();
	ЗаполнитьДолги();
	
КонецПроцедуры // ЗаполнитьАвтоматически()

// Процедура заполняет список долгов.
//
&НаСервере
Процедура ЗаполнитьДолги()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация,
	|	ОтобранныеДолги.Услуга,
	|	ОтобранныеДолги.МесяцНачисления,
	|	ОтобранныеДолги.Сумма,
	|	ОтобранныеДолги.ПризнакАванса
	|ПОМЕСТИТЬ ТаблицаОтобранныеДолги
	|ИЗ
	|	&ТаблицаОтобранныеДолги КАК ОтобранныеДолги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) КАК Сумма,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса КАК ПризнакАванса
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
	|		РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
	|		ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстатки.Организация КАК Организация,
	|		ЛОЖЬ КАК ПризнакАванса
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления < &Период
	|					И МесяцНачисления > &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаОтобранныеДолги.Услуга,
	|		ТаблицаОтобранныеДолги.МесяцНачисления,
	|		-ТаблицаОтобранныеДолги.Сумма,
	|		ТаблицаОтобранныеДолги.Организация,
	|		ТаблицаОтобранныеДолги.ПризнакАванса
	|	ИЗ
	|		ТаблицаОтобранныеДолги КАК ТаблицаОтобранныеДолги
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетам.Услуга,
	|		РасчетыПоЛицевымСчетам.МесяцНачисления,
	|		РасчетыПоЛицевымСчетам.Сумма,
	|		РасчетыПоЛицевымСчетам.Организация,
	|		ЛОЖЬ
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
	|	ГДЕ
	|		РасчетыПоЛицевымСчетам.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления < &Период
	|		И РасчетыПоЛицевымСчетам.МесяцНачисления > &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.СуммаОстаток,
	|		РасчетыПоЛицевымСчетамОстаткиАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
	|				,
	|				Организация = &Организация
	|					И ЛицевойСчет = &ЛицевойСчет
	|					И МесяцНачисления = &ПустаяДата) КАК РасчетыПоЛицевымСчетамОстаткиАвансы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоЛицевымСчетамАвансы.Услуга,
	|		РасчетыПоЛицевымСчетамАвансы.МесяцНачисления,
	|		РасчетыПоЛицевымСчетамАвансы.Сумма,
	|		РасчетыПоЛицевымСчетамАвансы.Организация,
	|		ИСТИНА
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетамАвансы
	|	ГДЕ
	|		РасчетыПоЛицевымСчетамАвансы.Регистратор = &Ссылка
	|		И РасчетыПоЛицевымСчетамАвансы.МесяцНачисления = &ПустаяДата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Услуга,
	|		&ПустаяДата,
	|		ПланированиеАвансовЛицевыеСчета.СуммаНачислено,
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация,
	|		ИСТИНА
	|	ИЗ
	|		Документ.ПланированиеАвансов.ЛицевыеСчета КАК ПланированиеАвансовЛицевыеСчета
	|	ГДЕ
	|		ПланированиеАвансовЛицевыеСчета.Ссылка.Организация = &Организация
	|		И ПланированиеАвансовЛицевыеСчета.ЛицевойСчет = &ЛицевойСчет
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата >= &ДатаНач
	|		И ПланированиеАвансовЛицевыеСчета.Ссылка.Дата <= &ДатаКон) КАК РасчетыПоЛицевымСчетамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛицевымСчетамОстатки.Организация,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга,
	|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.ПризнакАванса
	|
	|ИМЕЮЩИЕ
	|	СУММА(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПризнакАванса УБЫВ,
	|	МесяцНачисления,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ВидУслуги.ПолеСортировки,
	|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ТаблицаОтобранныеДолги", ОтобранныеДолги.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаАванса));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ДатаАванса));

	СписокДолгов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьДолги()
